---
kind: method
id: M:Autodesk.Revit.DB.NumericRevisionSettings.Dispose
source: html/d9004400-1602-913f-772c-5366adc1450f.htm
---
# Autodesk.Revit.DB.NumericRevisionSettings.Dispose Method

Releases all resources used by the NumericRevisionSettings

## Syntax (C#)
```csharp
public void Dispose()
```